//3.6--浮点型
//36--整型
//k--字符
//----------------------------------------------------
//char-------字符数据类型
//short------短整型
//int--------整型
//long-------长整型
//long long--更长的整形
//float------单精度浮点数（22.2=2.22*10--可以浮动）
//double-----双精度浮点数（相比上面精度更高）
//----------------------------------------------------
//计算机中的的单位
//bit---比特位
//byte--字节 1byte=8bit
//kb----一千个字节
//mb
//gb
//tb
//pb
//----------------------------------------------------
//double(),float()--都有数据不精确的可能性
//----------------------------------------------------
// 
//转义字符--转变原字符的意思
//--\0--终止打印字符串
//--\n--换行
//--\?--防止三字母词
//--\'--打印字符常量'
//--\\--防止转义
//--\a--警告字符
//--\b--退格符
//--\f--进纸符
//--\r--回车
//--\t--水平制表符--与tap键功能一致
//--\v--垂直制表符
//--\ddd--ddd表示1~3个八进制数字
//--\xdd--dd表示2个16进制的数字
// 
//--%d--打印整型
//--%c--打印字符
//--%s--打印字符串
//--%f--打印flost类型的数据
//--%lf--打印double类型的数据
//--%zu--打印siezof的返回值

//--------------------------------------------------------

//#include <stdio.h>
//int main()
//{
//    printf("%s\n", "     **     ");
//    printf("%s\n", "     **     ");
//    printf("%s\n", "************");
//    printf("%s\n", "************");
//    printf("%s\n", "    *  *    ");
//    printf("%s\n", "    *  *    ");
//    return 0;
//}
//-----------------------------------------------------------

//#include <stdio.h>
//
//int main()
//{
//    printf("%s\n", "Name    Age    Gender");
//    printf("%s\n", "---------------------");
//    printf("%s\n", "Jack    18     man");
//    return 0;
//}
//--------------------------------------------------------------------


//#include <stdio.h>
//
//int main()
//{
//    int a = 40;
//    int c = 212;
//    int b = (-8 + 22) * a - 10 + c / 2;
//    printf("%d\n",b);
//
//    return 0;
//}
//-----------------------------------------------------------------------

//操作符

//--算数操作符--+、-、*、/、%

//--位移操作符--、<<

//--位操作符--&、^、|

//--赋值操作符--=、+=、-=、*=、/=、&=、^=、|=、>>=、<<=

//--单目操作符--! - + & sizeof ~ -- ++ * (类型)

//--关系操作符--> >= < <= != ==

//--逻辑操作符--&&--逻辑与  ||--逻辑或

//--条件操作符（三目操作符）--exp1 ? exp2: exp3

//--逗号表达式（逗号隔开的一串表达式）
//--从左向右依次计算，整个表达式的结果是最后一个表达式的结果

//--下标引用操作符--[]

//--函数调用操作符--()

//-------------------------------------------------------------------------
//--C语言的常见关键字--语言本身携带的

//--auto--自动--所有局部变量都是auto的通常被省略

//--bresk--跳出循环--场合下面循环一起使用--for , while , do while

//--const--常属性

//--sizeof--计算大小

//--void--无（函数的返回类型，函数参数）

int main()
{
	auto int a = 0;//自动变量


	return 0;
}
